controllers/SiteController.php

SELECT * FROM `articles_a` WHERE `id`=1
---
    public function actionIndex()
    {
        $var = ['waxa','waxa1','waxa2'];
        VarDumper::dump($var);
        Yii::warning('here the var', var_export($var,true));

        $articles = ArticlesA::find()->where(['id' => 1])->one();